Revit 2027 API
Toposolid.GetIntersectingElementData Method
 Gets intersection data of all intersecting elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IntersectingElementData> GetIntersectingElementData()
Public Function GetIntersectingElementData As IList(Of IntersectingElementData)
public:
IList<IntersectingElementData^>^ GetIntersectingElementData()
member GetIntersectingElementData : unit -> IList<IntersectingElementData>
Return Value
IList<IntersectingElementData>
 The array of all intersecting element data.
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace